---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalVisualLightTransmittance
source: html/072ee20e-d270-31ea-5949-d9aa9ec8529c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalVisualLightTransmittance Property

"Visual Light Transmittance"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalVisualLightTransmittance { get; }
```